20130722/KnockoutJS/app/views/home/index.html.erb

SELECT "categories".* FROM "categories"
---
	<!-- ko foreach: categories -->
	<li><a href="#" data-bind="text: name, click: $root.selectCategory"></a></li>